# Welcome to Pandas

<img 
src="">

### Installing `Pandas` in your computer

In [89]:
!pip install pandas
# Or write just "pip install pandas" on terminal

In [90]:
import pandas as pd

### Pandas Series

In [3]:
ob = pd.Series([1, 8, -4, 6])
ob

0    1
1    8
2   -4
3    6
dtype: int64

### Indexs

In [4]:
index = ob.index
index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj = pd.Series([4, 5, 8, -9], index=['s', 'd', 'g', 'y'])
obj

s    4
d    5
g    8
y   -9
dtype: int64

In [6]:
obj.index

Index(['s', 'd', 'g', 'y'], dtype='object')

#### We can access to single values in Series like Numpy array using labels

In [7]:
obj['d']

5

In [8]:
obj['s'] = 10

In [9]:
obj[['s', 'd', 'y']]

s    10
d     5
y    -9
dtype: int64

#### We use Numpy functions ar Numpy operations for filtering with boolean array, scalar multiplication, or applying math functions

In [10]:
obj[obj > 0]

s    10
d     5
g     8
dtype: int64

In [11]:
obj * 2

s    20
d    10
g    16
y   -18
dtype: int64

In [12]:
import numpy as np

np.abs(obj)

s    10
d     5
g     8
y     9
dtype: int64

In [13]:
's' in obj

True

In [14]:
'l' in obj

False

#### We have data contained in a Python dict, we can easily create a Series from it by passing the dict:

In [15]:
data = {'Tajikistan': 10_250_000,
        'Uzbekistan': 35_450_000,
        'Kazakhstan': 19_730_000,
        'Turkmenistan': 6_000_000,
        'Kirgyztan': 7_000_000
    }
obj2 = pd.Series(data)
obj2

Tajikistan      10250000
Uzbekistan      35450000
Kazakhstan      19730000
Turkmenistan     6000000
Kirgyztan        7000000
dtype: int64

In [16]:
countries = ['Tajikistan', 'Uzbekistan', 'Turkmenistan', 'Kirgyztan', 'Russia']

obj3 = pd.Series(data, index=countries)
obj3

Tajikistan      10250000.0
Uzbekistan      35450000.0
Turkmenistan     6000000.0
Kirgyztan        7000000.0
Russia                 NaN
dtype: float64

#### Here, 5 values found in data where were number of populations, but there no vallue for 'Russia' was found, it will take NaN (not number), which considered in pandas to mark missing values

#### We can use isnull and notnull functions to detect missing data

In [17]:
pd.isnull(obj3)

Tajikistan      False
Uzbekistan      False
Turkmenistan    False
Kirgyztan       False
Russia           True
dtype: bool

In [18]:
pd.notnull(obj3)

Tajikistan       True
Uzbekistan       True
Turkmenistan     True
Kirgyztan        True
Russia          False
dtype: bool

In [19]:
obj3.isnull()

Tajikistan      False
Uzbekistan      False
Turkmenistan    False
Kirgyztan       False
Russia           True
dtype: bool

#### Usefull fitures of Series

In [20]:
obj2

Tajikistan      10250000
Uzbekistan      35450000
Kazakhstan      19730000
Turkmenistan     6000000
Kirgyztan        7000000
dtype: int64

In [21]:
obj3

Tajikistan      10250000.0
Uzbekistan      35450000.0
Turkmenistan     6000000.0
Kirgyztan        7000000.0
Russia                 NaN
dtype: float64

In [22]:
obj2 + obj3

Kazakhstan             NaN
Kirgyztan       14000000.0
Russia                 NaN
Tajikistan      20500000.0
Turkmenistan    12000000.0
Uzbekistan      70900000.0
dtype: float64

#### Both Series object itself and its index have a name attribute, which integrates with other key areas of pandas functionally:

In [23]:
obj3.name = 'Populations'
obj3.index.name = 'Country name'
obj3

Country name
Tajikistan      10250000.0
Uzbekistan      35450000.0
Turkmenistan     6000000.0
Kirgyztan        7000000.0
Russia                 NaN
Name: Populations, dtype: float64

#### A Series's index can be altered in-place by assignment:

In [24]:
obj

s    10
d     5
g     8
y    -9
dtype: int64

In [25]:
obj.index = ['John', 'Peter', 'Kevin', 'Alan']
obj

John     10
Peter     5
Kevin     8
Alan     -9
dtype: int64

## DataFrame
### A DataFrame represents a rectangular table of data and contains an ordered collec‚Äê
### tion of columns, each of which can be a different value type (numeric, string,
### boolean, etc.).

In [26]:
data = {'Country': ['Tajikistan', 'Uzbekistan', 'Turkmenistan', 'Kirgyztan', 'Kirgyztan', 'U.S.A'],
        'Population': [10_250_000, 35_450_000, 19_730_000, 6_000_000, 7_000_000, 332_000_000],
        'Location': ['Asia', 'Asia', 'Asia', 'Asia', 'Europe', 'North America']}

df = pd.DataFrame(data)
df

        Country  Population       Location
0    Tajikistan    10250000           Asia
1    Uzbekistan    35450000           Asia
2  Turkmenistan    19730000           Asia
3     Kirgyztan     6000000           Asia
4     Kirgyztan     7000000         Europe
5         U.S.A   332000000  North America

### For large DataFrames, the head method selects only the first five rows:

In [27]:
df.head()

        Country  Population Location
0    Tajikistan    10250000     Asia
1    Uzbekistan    35450000     Asia
2  Turkmenistan    19730000     Asia
3     Kirgyztan     6000000     Asia
4     Kirgyztan     7000000   Europe

In [28]:
pd.DataFrame(data, columns=['Population', 'Location', 'Country'])

   Population       Location       Country
0    10250000           Asia    Tajikistan
1    35450000           Asia    Uzbekistan
2    19730000           Asia  Turkmenistan
3     6000000           Asia     Kirgyztan
4     7000000         Europe     Kirgyztan
5   332000000  North America         U.S.A

In [29]:
df2 = pd.DataFrame(data, columns=['Population', 'Location', 'Country', 'Ranking'], 
                   index=['one', 'two', 'three', 'four', 'five', 'six'])
df2

       Population       Location       Country Ranking
one      10250000           Asia    Tajikistan     NaN
two      35450000           Asia    Uzbekistan     NaN
three    19730000           Asia  Turkmenistan     NaN
four      6000000           Asia     Kirgyztan     NaN
five      7000000         Europe     Kirgyztan     NaN
six     332000000  North America         U.S.A     NaN

In [30]:
df2.columns

Index(['Population', 'Location', 'Country', 'Ranking'], dtype='object')

#### When access to DataFrame's column by dict-like notation or by attribute it returns a Series

In [31]:
df2['Country']

one        Tajikistan
two        Uzbekistan
three    Turkmenistan
four        Kirgyztan
five        Kirgyztan
six             U.S.A
Name: Country, dtype: object

In [32]:
df2.Location

one               Asia
two               Asia
three             Asia
four              Asia
five            Europe
six      North America
Name: Location, dtype: object

#### Rows can also be retrived by position or name with the special loc attribute

In [33]:
df2.loc['three']

Population        19730000
Location              Asia
Country       Turkmenistan
Ranking                NaN
Name: three, dtype: object

#### We can change the scalar value or an array of values

In [34]:
df2['Ranking'] = 1
df2

       Population       Location       Country  Ranking
one      10250000           Asia    Tajikistan        1
two      35450000           Asia    Uzbekistan        1
three    19730000           Asia  Turkmenistan        1
four      6000000           Asia     Kirgyztan        1
five      7000000         Europe     Kirgyztan        1
six     332000000  North America         U.S.A        1

In [35]:
df2.Ranking = np.arange(1, 7)
df2

       Population       Location       Country  Ranking
one      10250000           Asia    Tajikistan        1
two      35450000           Asia    Uzbekistan        2
three    19730000           Asia  Turkmenistan        3
four      6000000           Asia     Kirgyztan        4
five      7000000         Europe     Kirgyztan        5
six     332000000  North America         U.S.A        6

In [36]:
values = pd.Series([8, 15, 78, 1], index=['two', 'six', 'five', 'one'])

df2.Ranking = values
df2

       Population       Location       Country  Ranking
one      10250000           Asia    Tajikistan      1.0
two      35450000           Asia    Uzbekistan      8.0
three    19730000           Asia  Turkmenistan      NaN
four      6000000           Asia     Kirgyztan      NaN
five      7000000         Europe     Kirgyztan     78.0
six     332000000  North America         U.S.A     15.0

In [37]:
df2['Asian'] = df2.Location == 'Asia'
df2

       Population       Location       Country  Ranking  Asian
one      10250000           Asia    Tajikistan      1.0   True
two      35450000           Asia    Uzbekistan      8.0   True
three    19730000           Asia  Turkmenistan      NaN   True
four      6000000           Asia     Kirgyztan      NaN   True
five      7000000         Europe     Kirgyztan     78.0  False
six     332000000  North America         U.S.A     15.0  False

### The `del` method used to remove this column:

In [38]:
del df2['Asian']
df2.columns

Index(['Population', 'Location', 'Country', 'Ranking'], dtype='object')

In [39]:
pop = {'Tajikistan': {2001: 2.4, 2002: 2.9},
        'Uzbekistan': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df3 = pd.DataFrame(pop)
df3

      Tajikistan  Uzbekistan
2001         2.4         1.7
2002         2.9         3.6
2000         NaN         1.5

#### We can transpose the DataFrame (swap rows and columns) with similar syntax to a Numpy

In [40]:
df3.T

            2001  2002  2000
Tajikistan   2.4   2.9   NaN
Uzbekistan   1.7   3.6   1.5

#### We can use Series to create new DataFrame

In [41]:
data = {'Tajikistan': df3['Tajikistan'][:-1],
        'Uzbekistan': df3['Uzbekistan'][:-1]}
pd.DataFrame(data)

      Tajikistan  Uzbekistan
2001         2.4         1.7
2002         2.9         3.6

In [42]:
df3.index.name = 'year' 
df3.columns.name = 'Countries'

In [43]:
df3

Countries  Tajikistan  Uzbekistan
year
2001              2.4         1.7
2002              2.9         3.6
2000              NaN         1.5

In [44]:
df3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

### There are some methods of Pandas Index

In [45]:
idx1 = pd.Index([2, 8, 6, 9, 8])
idx2 = pd.Index([1, 5, 6, 2])
print(idx1)
idx2

Index([2, 8, 6, 9, 8], dtype='int64')

Index([1, 5, 6, 2], dtype='int64')

In [46]:
idx1.difference(idx2) # -> returns the difference of value from second Index

Index([8, 9], dtype='int64')

In [47]:
idx1.append(idx2) # -> adds value or values at the end of Index

Index([2, 8, 6, 9, 8, 1, 5, 6, 2], dtype='int64')

In [48]:
idx1.intersection(idx2) # -> returns the general values

Index([2, 6], dtype='int64')

In [49]:
idx1.union(idx2) # -> returns non general values

Index([1, 2, 5, 6, 8, 8, 9], dtype='int64')

In [50]:
idx1.isin(idx2) # -> checks the given values in another index and returns bool

array([ True, False,  True, False, False])

In [51]:
idx1.delete(1) # -> removes item by its index

Index([2, 6, 9, 8], dtype='int64')

In [52]:
idx2.drop(6) # -> removes item in Index by value

Index([1, 5, 2], dtype='int64')

In [53]:
idx1.insert(2, 18) # -> adds value with index

Index([2, 8, 18, 6, 9, 8], dtype='int64')

In [54]:
idx1.is_unique # -> checks values for uniqueness and returns bool

False

In [55]:
idx1.unique() # -> returns unique version of Index

Index([2, 8, 6, 9], dtype='int64')

### Reindexing

In [56]:
obj = pd.Series(np.arange(4), index=['a', 'b', 'c', 'd'])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [57]:
obj2 = obj.reindex(['e', 'd', 'c', 'b', 'a'])
obj2

e    NaN
d    3.0
c    2.0
b    1.0
a    0.0
dtype: float64

#### For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing. The method option allows us to do this, using method such as ffill, which forward-fills the values:

In [58]:
obj3 = pd.Series(['apple', 'banana', 'cherry'], index=[0, 2, 4])
obj3

0     apple
2    banana
4    cherry
dtype: object

In [59]:
obj3.reindex(np.arange(6), method='ffill')

0     apple
1     apple
2    banana
3    banana
4    cherry
5    cherry
dtype: object

In [60]:
df = pd.DataFrame(np.arange(9).reshape(3, 3),
                  index=['a', 'b', 'c'],
                  columns=['Apple', 'Banana', 'Cherry'])
df

   Apple  Banana  Cherry
a      0       1       2
b      3       4       5
c      6       7       8

In [61]:
df.reindex(['a', 'b', 'c', 'd'])

   Apple  Banana  Cherry
a    0.0     1.0     2.0
b    3.0     4.0     5.0
c    6.0     7.0     8.0
d    NaN     NaN     NaN

In [62]:
fruits = ['Apple', 'mango', 'Banana']
df.reindex(columns=fruits)

   Apple  mango  Banana
a      0    NaN       1
b      3    NaN       4
c      6    NaN       7

#### We can reindex more succinctly by label-indexing with loc

In [63]:
df.loc[['a', 'c', 'b']]

   Apple  Banana  Cherry
a      0       1       2
c      6       7       8
b      3       4       5

## Reindex function argumets

In [64]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                  'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},
                  index=index)
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [65]:
new_index = ['Safari', 'IE10', 'Brave', 'Opera']
df.reindex(index=new_index) # -> index

        http_status  response_time
Safari        404.0           0.07
IE10          404.0           0.08
Brave           NaN            NaN
Opera           NaN            NaN

### _fill_value_: puts the given value as value of unfounded index

In [66]:
df.reindex(index=new_index, fill_value=0)

        http_status  response_time
Safari          404           0.07
IE10            404           0.08
Brave             0           0.00
Opera             0           0.00

In [67]:
df.reindex(new_index, fill_value='Missed')

       http_status response_time
Safari         404          0.07
IE10           404          0.08
Brave       Missed        Missed
Opera       Missed        Missed

## Indexing, Selection and Filtering

In [68]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [69]:
obj['b']

1.0

In [70]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [71]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [72]:
obj[[1, 3]]

/tmp/ipykernel_3818/4102577471.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [73]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [74]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [75]:
obj['b':'c'] = 10
obj

a     0.0
b    10.0
c    10.0
d     3.0
dtype: float64

In [76]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [77]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [78]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [79]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [80]:
data[data.three > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [81]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [82]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## Selection with loc and iloc

In [83]:
data.loc['Colorado', ['two', 'one']]

two    5
one    0
Name: Colorado, dtype: int64

In [84]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [85]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [86]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [87]:
data.iloc[:, 2][data.three > 5]

Colorado     6
Utah        10
New York    14
Name: three, dtype: int64

## Arithmetic operations and methods

In [92]:
a1 = pd.Series([8.5, -8.7, 5.3, 4.9, -1.6], index=['a', 'b', 'c', 'd', 'e'])
a2 = pd.Series([4.1, 5.9, -6.7, 1.8, 4.65], index=['a', 'c', 'e', 'f', 'n'])

a1

a    8.5
b   -8.7
c    5.3
d    4.9
e   -1.6
dtype: float64

In [93]:
a2

a    4.10
c    5.90
e   -6.70
f    1.80
n    4.65
dtype: float64

In [94]:
a1 + a2

a    12.6
b     NaN
c    11.2
d     NaN
e    -8.3
f     NaN
n     NaN
dtype: float64

In [96]:
df1 = pd.DataFrame(np.arange(9.).reshape(3, 3), columns=list('abc'),
                   index=['apple', 'banana', 'cherry'])

df2 = pd.DataFrame(np.arange(12.).reshape(4, 3), columns=list('bcd'),
                   index=['apple', 'mango', 'banana', 'limon'])
df1

          a    b    c
apple   0.0  1.0  2.0
banana  3.0  4.0  5.0
cherry  6.0  7.0  8.0

In [97]:
df2

          b     c     d
apple   0.0   1.0   2.0
mango   3.0   4.0   5.0
banana  6.0   7.0   8.0
limon   9.0  10.0  11.0

In [98]:
df1 + df2

         a     b     c   d
apple  NaN   1.0   3.0 NaN
banana NaN  10.0  12.0 NaN
cherry NaN   NaN   NaN NaN
limon  NaN   NaN   NaN NaN
mango  NaN   NaN   NaN NaN

## Methods
### Using the add method on df1, I pass df2 and an argument to fill_value:

In [102]:
df1.add(df2, fill_value=0)

          a     b     c     d
apple   0.0   1.0   3.0   2.0
banana  3.0  10.0  12.0   8.0
cherry  6.0   7.0   8.0   NaN
limon   NaN   9.0  10.0  11.0
mango   NaN   3.0   4.0   5.0

In [103]:
1 / df1

               a         b      c
apple        inf  1.000000  0.500
banana  0.333333  0.250000  0.200
cherry  0.166667  0.142857  0.125

### Methods which starts with `r` like 'rdiv(n)' means that n / df but 'div(n)' means df / n

In [109]:
df1.rdiv(1)

               a         b      c
apple        inf  1.000000  0.500
banana  0.333333  0.250000  0.200
cherry  0.166667  0.142857  0.125

In [110]:
df1.div(1)

          a    b    c
apple   0.0  1.0  2.0
banana  3.0  4.0  5.0
cherry  6.0  7.0  8.0

| Method              | Describtion                      |
|---------------------|----------------------------------|
 | add, radd           | Methods for addition (+)         |
 | sub, rsub           | Methods for subtraction (-)      |
 | div, rdiv           | Methods for division (/)         |
 | floordiv, rfloordiv | Methods for floor division (//)  |
 | mul, rmul           | Methods for multiplication (*)   |
 | pow, rpow           | Methods for exponentiation (**)  |

### Arithmetic operations between DataFrames and Series

In [112]:
df = pd.DataFrame(np.arange(12).reshape(4, 3), columns=list('abc'),
                  index=['apple', 'banana', 'cherry', 'limon'])

obj = df.iloc[0]
df

        a   b   c
apple   0   1   2
banana  3   4   5
cherry  6   7   8
limon   9  10  11

In [113]:
obj

a    0
b    1
c    2
Name: apple, dtype: int64

In [114]:
df - obj

        a  b  c
apple   0  0  0
banana  3  3  3
cherry  6  6  6
limon   9  9  9

In [116]:
obj2 = pd.Series(np.arange(3), index=list('abc'))

df + obj2

        a   b   c
apple   0   2   4
banana  3   5   7
cherry  6   8  10
limon   9  11  13

In [119]:
df.sub(obj2, axis='columns')

        a  b  c
apple   0  0  0
banana  3  3  3
cherry  6  6  6
limon   9  9  9

## Function Application and Mapping
##### Numpy functions also work in pandas object

In [123]:
df = pd.DataFrame(np.random.randn(4, 3), columns=list('abc'),
                  index=['apple', 'banana', 'cherry', 'mango'])
df

               a         b         c
apple   0.271013 -0.204520  1.176303
banana -1.503525  0.226259 -0.283177
cherry -2.232779 -2.109124  0.284928
mango   0.640459 -0.213183  2.011920

In [124]:
np.abs(df)

               a         b         c
apple   0.271013  0.204520  1.176303
banana  1.503525  0.226259  0.283177
cherry  2.232779  2.109124  0.284928
mango   0.640459  0.213183  2.011920

### Another frequent operation is applying a function on one-dimensional arrays to each column or row. DataFrame‚Äôs apply method does exactly this:

In [125]:
func = lambda a: a.max() - a.min()

df.apply(func)

a    2.873237
b    2.335383
c    2.295097
dtype: float64

### If you pass axis='columns' to apply, the function will be invoked once per row instead:

In [126]:
df.apply(func, axis='columns')

apple     1.380823
banana    1.729784
cherry    2.517707
mango     2.225104
dtype: float64

In [128]:
df.apply(func, axis='index')

a    2.873237
b    2.335383
c    2.295097
dtype: float64

In [129]:
def func(a):
    return pd.Series([a.min(), a.max()], index=['min', 'max'])
df.apply(func)

            a         b         c
min -2.232779 -2.109124 -0.283177
max  0.640459  0.226259  2.011920